{
    "title": "Harvard University Courses, Rankings, Fees, Admissions 2023, Scholarships",
    "Veda Burman": "Harvard University is the oldest higher education institution in USA offering admission in Fall, Winter, Spring or Summer intakes. Established in 1636, Harvard has three campus locations- Cambridge, Allston, and Boston. The Ivy League USA institution is home to 16% international students hailing from 150+ countries including 613 Indian students and scholars.\nHarvard University acceptance rate is merely 4.7% for undergraduate programs and 10.3% for MBA program, for the Fall intake. There are around 90 undergraduate degrees and 150 graduate degree courses to choose from. Of these, popular Harvard University programs include Business Administration, Law, and Medicine. The eligibility requirements for Harvard is similar to any other Ivy League colleges, yet admission are granted to only academic elites. Applications for 2023 admissions commence from mid-August. Check Out: Harvard Application Process\nAverage Harvard University fees for an Indian student is 51,900 USD (38.31 lakh INR) per year, marking it as a high-end university in terms of cost. To cover these expenses, there are need-based Harvard University scholarships, which benefits around 60% of new entrants. There’s hardly any global company where Harvard graduates are not welcome because of its legacy of over 385 years. EMBA graduates of Harvard earn an average annual salary of 182,000 USD per annum. Harvard graduates are highly regarded all over the world. Top employers of the university include Google, Facebook, Apple, IBM, Morgan Stanley, and several others. Explore: Harvard University Placements",
    "Harvard University Rankings": "A plethora of Harvard University courses are ranked #1 by QS subject Rankings and THE Rankings. The subject-specific ranking comparison of Harvard University with two top universities in USA according to U.S. News and World Report are as follows:",
    "comparisons": {
        "Harvard vs MIT": "https://collegedunia.com/comparison/1090-harvard-university-vs-1087-massachusetts-institute-of-technology",
        "Harvard vs Stanford University": "https://collegedunia.com/comparison/2074-stanford-university-vs-1090-harvard-university",
        "Harvard vs Yale University": "https://collegedunia.com/comparison/1699-yale-university-vs-1090-harvard-university"
    },
    "Harvard University (Spanish)": "https://collegedunia.com/usa/article/c-1090-universidad-de-harvard-cursos-clasificaciones-tarifas-admisiones-2023-becas",
    "Harvard University Rankings comparison": "Subject Harvard University Massachusetts Institute of Technology Stanford UniversityOncology #1 #16 #14Surgery #1 - #9Computer Science #14 #3 #2Mathematics #7 #1 #2Chemistry #14 #5 #1Physics #3 #1 #2",
    "Harvard University Courses": "Harvard University Courses\nIndian students can choose from 22 postgraduate certificates, 50 undergraduate concentrations, 149 masters, 2 associate's, and 105 doctoral programs at Harvard. Ranging from medicine courses to law programs, from social science programs to business administration; Harvard University programs includes all. Some of other reasons to why opt for Harvard University courses are:\nHarvard University is a liberal arts colleges, allowing students to enrol and then choose their UG concentration.\nHarvard Business School offers a 2 year full-time residential MBA program, which includes 37% international student population.\nHarvard offers up to 129 free and paid online courses for all.\nThere are around 900 continuing education programs for international students, working professional, and retired adults.",
    "Harvard University Top Programs": [
        "Bachelor of Science [B.S], Physics INR 42,10,603",
        "Master of Law [L.L.M] INR 57,98,502",
        "Master of Public Administration [M.P.A] INR 44,74,800",
        "Master of Science [M.S], Biostatistics INR 50,58,849",
        "Master of Science [M.S], Biomedical Informatics INR 46,11,962",
        "Master of Science [M.S], Data Science INR 49,37,165",
        "Master of Science [M.S], Applied Computation INR 20,96,451",
        "Master of Science [M.S], Computational Science and Engineering INR 45,18,270",
        "Bachelor of Science [B.S], Mechanical Engineering INR 42,10,603",
        "Master of Architecture [M.Arch] INR 43,98,069",
        "Bachelor of Science [B.S], Neurobiology INR 42,10,603",
        "Master of Business Administration [M.B.A] INR 60,46,315"
    ],
    "Harvard University International Student Enrollments": [
        "As demonstrated by its QS subject rankings, the institution is the leader across several subject areas like Medicine, Law, Surgery, etc. Being this popular, Harvard University admissions are offered to students from across the globe. With 4,818 international enrollments, Harvard University boasts an international student population of 16%. The 2022 international student enrollment by Harvard school is showcased below:",
        "https://images.collegedunia.com/public/image/dc34b3d5bfe50c5ab76aa0d871fa75f8.png?tr=w-1076,h-371,c-force"
    ],
    "Harvard University Admission Process": [
        "Admission to Harvard University is a multistep process involving application, arranging standardized test scores, submission of documents, fees, and sometimes appearing in an interview. The application process to Harvard is explained below in detail:",
        {
            "portals": [
                "https://shibboleth-idp.collegenet.com/idp/profile/SAML2/Redirect/SSO?SAMLRequest=fZJfT8IwFMW%2FytJ31lEWAg1bMuFBEhTCpg%2B%2BmK67QGPXzt7O6bd3%2FFHxhbem%2FfWce047Q1HrhmetP5gtvLeAPvistUF%2BOkhI6wy3AhVyI2pA7iXPs4cVZ2HEG2e9lVaTIEME55U1c2uwrcHl4D6UhKftKiEH7xvklHZdF9Zf0gqtjmho3Z7u32h%2BUGVpNfhDiGjpUZ3RzTovSLDox1FGHOk%2FGfzlB6pqwt5fwx4M%2BH5Z036L9nPtlIaL1BYq5UB6mudrEiwXCXllUE3HQkqxG%2B2iWMRQVSwelmw6FXI8mbAeQ2xhadAL4xPCIhYNoumATYrhiEcTHscvJNhc4t8pUymzv91VeYaQ3xfFZnCO9wwOT9F6gKSzY%2BP8ZOyu3uC2rPgpnqS3ar7qDBs6o1dWZ9%2BGP%2Fbay8XGaiW%2Fgkxr280dCA8JGRKanq%2F8%2FyjpNw%3D%3D&RelayState=https%3A%2F%2Fwww.mycoalition.org%2Fgk",
                "https://www.commonapp.org/",
                "https://www.universalcollegeapp.com/"
            ]
        },
        "Type of Deadlines DateEarly action application November 1Early action decision Mid-DecemberRegular action application January 1Regular action decision Late MarchConfirmation deadline for students May 1Test scores submission End of October or latest by December"
    ],
    "Harvard University Admission Requirements": "Category Undergraduate Admission Requirements Graduate Admission RequirementsTranscriptsFinal school report and transcriptsAcademic transcripts with GPA of 4.0/4 (97-100%)Midyear report Midyear school report -Teacher evaluation forms 2 teacher evaluation forms -SOP SOP for USA SOP within 1,500 wordsLOR Academic LOR (Optional) 3 LOR (2 academic, 1 professional)Proof of finances - Financial certificationCV/Resume - RésuméStandardized test scores SAT/ACT score (Optional) GRE or GMAT (if applicable) (Median GRE: 300, Median GMAT score: 730)English proficiency TOEFL score (Optional) TOEFL Score of 104 or aboveAdditional requirements Supplementary materials such as artwork, music recordings, etc (Optional) Specific graduate school or program requirementsInterviews Interview (Non-compulsory) Interview (Optional)",
    "Admission links details": {
        "Harvard MS in Data Science Admissions": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/master-of-science-msc-data-science-181896",
        "Harvard MBA Admissions": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/master-of-business-administration-mba-179786",
        "Harvard Law Admissions": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/master-of-law-llm-189139"
    },
    "Harvard University Campus": "Harvard campus was established by vote of the Great and General Court of the Massachusetts Bay Colony. The university has 3 main campuses located in Cambridge, Allston, and Boston's Longwood. The main campus of Harvard University stands with several other branch campuses mainly for graduates.Harvard University campus houses 10 hospitals, 5 museums, 2 theatres, 3 athletic facilities, 28 libraries, 12 residential buildings, several academic and administrative buildings and other buildings. The Harvard Library is around 400 years old and is the oldest library system in USA.Community involvement, extra-curricular activities, leadership qualities, and a remarkable personal character are secondary factors that influence the admission process apart from spectacular academic grades. The university offers 42 Division I intercollegiate varsity teams for women and men as well as intramural sports to students.Over 450 student organizations are open to all students at the institute for recreational activity. More than 80% of its students participate in at least one athletic activity. Its students actively engage in quality community services.",
    "Harvard University Accommodations": [
        "The university offers accommodation across 12 residence halls for Harvard undergraduates. There are 4 Graduate School of Arts and Science residence halls as well as other Off-Campus residence halls for graduates. It offers 12 houses for upperclassmen with amenities viz. libraries, lounges, and recreational and functional spaces.",
        "A typical residence hall has all the basic amenities, Wi-Fi, laundry service, kitchens with all modern facilties, vending machines.Each hall has a Cable and DVD set, washers, dryers, and a computer lab.Reservations and special accommodations are provided for applicants with disabilities upon demand.Gender Inclusive Living options and housing for LGBTQ students are provided as well.The cost of living on-campus ranges around 1,000-4,500 USD (~76,000 to 3.43 lakhs INR) per month.",
        "Students can choose to stay off-campus with rent ranging from 1,500 up to 3,000 USD (~1.14 to 2.29 lakhs INR) per month.The university provides off-campus residence information such as Harvard's own 60 off-campus properties and other external rent information.Students can register themselves in the ‘Harvard Off-Campus Housing portal to search and compare the available residence options.These apartments are offered as single, Studio, one-Bedroom, two-Bedroom, three-Bedroom, four-Bedroom, and suites."
    ],
    "Harvard University Cost of Attendance": [
        "Fees Cost Per Year (in INR)Tuition 41.3 lakhsBoard and Room 14.06 lakhsBooks and Personal expenses 2.67 lakhsStudent services fee 2.28 lakhsStudent activities fee 15,300Student health fee 92,240Total 61.38 lakhs",
        "School Average Fees in INRGraduate School of Arts & Sciences 41.9 lakhsHarvard Graduate School of Education 43.75 lakhsHarvard Graduate School of Design 43.94 lakhsHarvard Medical School 35.79 lakhsHarvard Extension School 24.76 to 29.71 lakhsHarvard Kennedy School 28.17 to 44.12 lakhs"
    ],
    "Harvard University Scholarships": "The university offers an array of financial aid for its aspirants which includes grants, student jobs, waivers, and scholarships for international students in USA. 100% of financial needs are met at Harvard where nearly 20% of families pay nothing at the institute. Around 55% students at Harvard College receive need-based scholarships to study in USA. Over 2,000 individual endowment and gift funds are offered by The Faculty of Arts and Sciences Scholarship program.International students are qualified for all aids at the institute as much as domestic students do except loans and federal or state aids. Additional financial documents may be required for the application for aids during admission application.The university awards over 1 billion USD in financial aid like scholarships and grants each year. The average grant amount received by students is 12,000 USD. Students from families with an annual income of less than 65,000 USD do not have to pay any tuition fees. Candidates from families with annual income between 65,000 to 150,000 USD have to pay 10% of the tuition fee.\nScholarship Total Award Amount in INR\nThe Robert S. Kaplan Life Sciences Fellowship 15.47 lakhs\nHorace W. Goldsmith Fellowship 7.73 lakhs\nBoustany MBA Harvard Scholarship 79 lakhs\nHGSE Financial Aid Tuition, loan and miscellaneous expenses\nSome other financial aid available to international students include:\nJoseph Collins Foundation Scholarship with varying amounts.\nAcademic Scholars Award awarded by the organization to in-residence international graduates. The award is four each year and it's worth 67,000 USD.\nGraduate Consortium on Energy and Environment Fellowship with varying amounts. Scholarships in USA in https://collegedunia.com/usa/scholarship.",
    "Harvard University Alumni": "Harvard University AlumniHarvard University presently has 371,000 living alumni worldwide. The university alumni enjoys the following benefits: Harvard Alumni enjoy savings on selected ThinkPad notebook computersNetworking with other alumni and with current Harvard students by updating profile information with career networking capabilities.Harvard Employees Credit Union renders a variety of products and services to the Harvard community.Unique access to Harvard's online and offline libraryHarvard University Notable AlumniThe Harvard University alumni network boosts to have 8 US Presidents, 79 Nobel Laureates, 62 living billionaires, 242 Marshall Scholars, and 359 Rhodes Scholars. Some of the popular names are: Barack Obama -44th President of the United StatesMark Zuckerberg -Co-Founder and CEO of FacebookAlbert A. Gore Jnr. -Former Vice President of the United StatesGeorge W. Bush – 43rd US PresidentBill Gates – Co-founder of MicrosoftAlso Explore: Harvard University Student Profile in  https://collegedunia.com/usa/college/1090-harvard-university-cambridge/profile",
    "Harvard University Placements": "The Office of Student Career Development assist Harvard University students with career advice. MBA Placements of Harvard University is one of the most attractive feature of the institute offering the graduates with lucrative salaries acorss world-famous companies. Harvard graduates working as Neurosurgeon earn the highest average annual salary of 402,000 USD per annum.Most of the Harvard Business School graduates secure employment in Apple, Google, and Facebook. Besides, firms like Bain & Company, McKinsey, IBM and Morgan Stanley are among the other recruiters of Harvard graduates. The average salary of Harvard Business School graduates is 150,000 USD per annum. 51% of the employed graduates get a median signing bonus of 30,000 USD.The institute organizes very productive career fairs for students at various levels each year. According to PayScale, the average annual salary of Harvard graduates is 91,000 USD. Situated in Cambridge, Massachusetts, Harvard is often compared with MIT, though picking among the two can be difficult Harvard slightly surpasses MIT in certain factors. This oldest higher education institution in the US has managed to make and keep a worldwide brand name and claims to be home to only the academically elite class.",
    "Harvard FAQs": {
        "Ques. Why is Harvard so famous ?": "Ans.  Harvard University is the oldest private research institute in the USA. It is the first higher education institute in USA. The university welcomes students arriving from 150+ countries in the world. Harvard is one of the top 5 universities in the world, with several top ranked programs, especially the STEM courses.",
        "Ques. What GPA do you need to go to Harvard?": "Ans. Harvard is one of the elite universities in the world with an undergraduate acceptance rate of 4.7%. You will need a GPA of 4.0 on a 4.0 scale (97-100%) for admission to Harvard University. A majority of the admitted students at Harvard University topped their class in previous academic years.",
        "Ques. How many Indian students get into Harvard every year?": "Ans. Harvard University welcomes around 610 Indian students and scholars every year. In Fall 2021, the university enrolled 613 Indian students and scholars. ",
        "Ques. Is Yale or Harvard better?": "Ans. Harvard University and Yale University are two top-notch universities in the world. From academic credentials to heritage and athletics, both the universities give tough competition to each other. Harvard University is ranked at #5 in QS World Rankings, 2023 leaving behind Yale at #18. According to Times Higher Education, 2022, Harvard University shares the #2 position with California Institute of Technology leaving Yale University at #9. However, this does not make Yale an inferior institution, ranking among the top universities in the world is not a cakewalk.",
        "Ques. How much does studying at Harvard cost?": "Ans. The cost of pursuing Harvard University undergraduate programs is around 75,000 USD. The graduate tuition expenses range between 30,000 to 56,000 USD for 2 years. The cost of living for 10 months for the graduate students at Harvard University is around 45,000 USD.",
        "Ques. What are the fees of Harvard University in Indian rupees?": "Ans. The total cost of studying the undergraduate programs at Harvard University is around 61 lakhs INR. The tuition cost of the graduate students widely varies across graduate schools from 24 to 45 lakhs INR. Living expenses for the graduate students range around 36 lakhs INR for 10 months.",
        "Ques. How many students does Harvard accept each year?": "Ans. Harvard University has enrolled 21,119 full-time students and 4,391 part-time students in Fall 2021. The university has enrolled a total of 25,110 students including adjustment for joint degree students. ",
        "Ques.": "Ans. Harvard University exhibits a remarkably low undergraduate acceptance rate of 4.7%. However, Harvard is not the university with the lowest acceptance rate. Stanford University has an even lower acceptance rate of 3.94%. Harvard University acceptance rate is gradually decreasing over the years due to the increasing number of applications and advanced screening process.",
        "Ques. What company hires the most Harvard graduates?": "Ans. Harvard University graduates are employed across Google, Facebook, Bain & Company, McKinsey, Apple, IBM, Morgan Stanley and several other top recruiters. Top employers of the Business program graduates and summer interns include Microsoft, Adobe, Amazon, Blackstone, Bank of America, Capital One, Nike, Cognizant, Dell, Deloittee, Tesla, Godrej, IBM, Ebay, Lockheed Martin, Walmart, Twitter, Tiktok, Uber and numerous others.",
        "Ques. What is the average salary of Harvard MBA graduate?": "Ans. Harvard University MBA graduates earn an average salary of 179,000 USD per annum. The average salary of Harvard Business School graduates is 150,000 USD per year.",
        "Ques. In which state is Harvard University located?": "Ans. Harvard University is located in the city of Cambridge at the US state of Massachusetts. The city is known for its populous culture and of course, the Harvard University campus. ",
        "Ques. Is Harvard campus beautiful?": "Ans. Harvard University Campus is beautifully decorated with lush greeneries. The Harvard Yard is the grassy center of the university surrounded by various halls, libraries, Memorial Church and colleges of the university.",
        "Ques. What is student life like at Harvard?": "Ans. Harvard University students enjoy a colorful student life with numerous extracurricular activities, community involvement, and intramural sports. Students enjoy recreation activities across 450+ student organizations. The campus offers adequate private space through Roombook, a private room booking facility for the Faculty of Arts and Sciences. Dining facilities, health and wellness support, discounts, first-year resources and several other student support services enrich the student experience at Harvard University.",
        "Ques. Who is eligible for Harvard housing?": "Ans. Harvard University housing is available for only authorized occupants and their family members. The university provides reservation and special occupation facilities for applicants with disabilities. The university also supports gender inclusive living and provides housing for LGBTQ students.",
        "Ques. How much is housing at Harvard?": "Ans. The on-campus residence cost of Harvard University ranges from 1,000-4,500 USD (~76,000 to 3.43 lakhs INR) per month. The off-campus residence cost ranges from 1,500 up to 3,000 USD (~1.14 to 2.29 lakhs INR) per month. "
    },
    "Harvard University Popular Courses": "Top Streams:\nEngineeringBusinessComputer Science And EngineeringBiologyData Science And AnalyticsEntrepreneurshipMathematicsArchitectureElectrical And Electronics EngineeringSoftware EngineeringNeuroscienceLawFinanceMedicineFilm, Photography And MediaBiomedical StudiesDesignStatisticsMaterials SciencesSciencesComputer ScienceMechanical EngineeringSocial StudiesHealth CarePublic PolicyEnvironmental StudiesArtsFine ArtsInformation StudiesDesignEconomicsMolecular BiologyVisual ArtsJournalismChemistryPsychologyMusicEarth SciencesPlant SciencesLiteratureEnglishLanguageManagementHumanitiesPhilosophyPhysicsTechnologyTheologyAnthropologyPolitical ScienceInternational BusinessEducationImmunologyClinical ScienceNursingBiotechnologyDentistryHistoryGender StudiesView Less\nTop Degrees:\nM.B.AM.DL.L.MPh.D Computer ScienceB.A/B.ScPh.D Electrical EngineeringPh.DM.ArchM.SPh.D ManagementB.ScB.APh.D BiologyM.APh.D StatisticsM.Des/M.F.AM.A/M.ScM.P.AM.ThM.P.HM.EdM.MedB.A EconomicsD.M.DM.D/M.P.HView Less",
    "Harvard University Popular Course Overview": {
        "M.B.A": [
            "M.B.A(2 year)On CampusEnglishFull TimeINR 50.7 - 67 L/YrCheck Detailed FeesAvailable Courses3 CoursesExams ScoreIELTS7.5|TOEFL109|GRE326Application Deadline01 Jun, 2023Offered ByHarvard Business SchoolTop specializations:Entrepreneurship | Finance3 Students AppliedDownload Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs/mba-courses"
            }
        ],
        "M.S": [
            "M.S(1 year - 2 year)Co Op, On CampusEnglishFull TimeINR 18.7 - 50.7 L/YrCheck Detailed FeesAvailable Courses26 CoursesExams ScoreTOEFL100|IELTS7|GRE292Application Deadline01 Jun, 2023Top specializations:Data Science | Computational Science and Engineering+23 more7 Students Applied8 Students AdmittedDownload Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs/ms-courses"
            }
        ],
        "M.D": [
            "M.D(5 year)On CampusEnglishFull TimeINR 50 L/YrCheck Detailed FeesAvailable Course1 CourseExams ScoreTOEFL90|IELTS6.5|GRE292Application Deadline01 Jun, 2023Ranked #2 out of 1200 by THE Global Ranking 2022Download Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs?course_id=215048"
            }
        ],
        "L.L.M": [
            "L.L.M(1 year)On CampusEnglishFull TimeINR 50.7 L/YrCheck Detailed FeesAvailable Course1 CourseExams ScoreTOEFL109|IELTS7.5|GRE292Application Deadline01 Jun, 2023Offered ByHarvard Law SchoolDownload Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs?course_id=189139"
            }
        ],
        "Ph.D Computer Science": [
            "Ph.D Computer Science(5 year)On CampusEnglishFull TimeINR 25.3 L/YrCheck Detailed FeesAvailable Course1 CourseExams ScoreTOEFL90|IELTS6.5|GRE292Application Deadline01 Jun, 2023Top specializations:Computer Science3 Students Applied2 Students AdmittedDownload Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs?course_id=179948"
            }
        ],
        "B.A/B.Sc": [
            "B.A/B.Sc(4 year)On CampusEnglishFull TimeINR 50 L/YrCheck Detailed FeesAvailable Course1 CourseExams ScoreTOEFL80|IELTS6.5|ACT32Application Deadline01 Jan, 2023Top specializations:Computer ScienceDownload Course DetailsDownload Brochure",
            {
                "course link": "https://collegedunia.com/usa/college/1090-harvard-university-cambridge/programs?course_id=181881"
            }
        ]
    },
    "Harvard University Student Profiles": {
        "Aaraadhak Divedi": [
            "Summer 2022AdmittedAaraadhak DivediM.S Biomedical InformaticsIELTS8"
        ],
        "Geet Devi": [
            "Fall 2021AdmittedGeet DeviM.Eng Computational Science and EngineeringTOEFL110"
        ],
        "Saanu Goyal": [
            "Spring 2021AdmittedSaanu GoyalM.Eng Design EngineeringTOEFL100GRE314"
        ],
        "Aarati Yadav": [
            "Summer 2020AdmittedAarati YadavM.S Health Data ScienceIELTS7"
        ]
    },
    "Harvard University Ranking": "Overall #5 out of 1400 in Global Ranking( #3 out of 190 in USA 2023)Business #2 Ranking of: Harvard Business School( #2 out of 111 in USA 2023)Medicine #1 out of 124 in Global Ranking( #1 out of 99 in USA 2023)Law #4 out of 192 in Global Ranking( #4 out of 167 in USA 2023)Business #5 out of 134 in Global Ranking( #3 out of 131 in USA 2023)Engineering #21 out of 200 in Global Ranking( #14 out of 193 in USA 2023)Education #2 out of 274 in Global Ranking( #2 out of 248 in USA 2023)View More >>",
    "Harvard University Ratings": "8.4 out of 109.0/10Academic8.5/10Accommodation9.5/10Faculty9.5/10Infrastructure9.0/10Placement10.0/10Social Life",
    "Harvard University Reviews": {
        "Tamalika Sarwate": {
            "rating": "9.5/10",
            "\"An environment friendly - Harvard\"": "https://collegedunia.com/usa/reviews/10724-tamalika-sarwate-review-on-harvard-university",
            "comment": "My cousins had studied in this college and had completed their master's program. They suggested even I should do mine under graduation from here. So I went online and I had sent my application by post. I had to send an application fee of $75.Fees : Tuition costs annually $47,730, other fees are $4,200.9/10ACADEMIC/FOOD10/10FACULTY9/10INFRASTRUCTURE10/10ACCOMODATION9/10PLACEMENT10/10EXTRACURRICULAR0 0"
        },
        "Atthu": {
            "rating": "7.3/10",
            "\"Study with world's top-notch faculty with brilliant Infrastructure\"": "https://collegedunia.com/usa/reviews/12272-atthu-review-on-harvard-university",
            "comment": "Average Fees : 70,000/ YearHarvard university is no 1 university in the world and I think this reason was enough to encourage me to apply. Mathematics because I love solving sums.9/10ACADEMIC/FOOD9/10FACULTY10/10INFRASTRUCTURE7/10ACCOMODATION9/10PLACEMENT0 0"
        }
    }
}